{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v1.7.2", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "conv2d_57/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_57/bias", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_109/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_109/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_109/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_109/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "depth_wise_conv2d_53/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "batch_normalization_110/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_110/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_110/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_110/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "conv2d_58/kernel", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "conv2d_58/bias", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_111/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_111/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_111/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_111/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "depth_wise_conv2d_54/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "batch_normalization_112/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_112/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_112/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_112/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "conv2d_59/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "conv2d_59/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_113/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_113/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_113/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_113/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "depth_wise_conv2d_55/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "batch_normalization_114/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_114/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_114/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_114/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_60/kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "conv2d_60/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_115/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_115/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_115/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_115/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "depth_wise_conv2d_56/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "batch_normalization_116/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_116/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_116/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_116/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv2d_61/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "conv2d_61/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_117/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_117/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_117/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_117/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "depth_wise_conv2d_57/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "batch_normalization_118/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_118/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_118/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_118/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv2d_62/kernel", "shape": [1, 1, 128, 256], "dtype": "float32"}, {"name": "conv2d_62/bias", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_119/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_119/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_119/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_119/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "depth_wise_conv2d_58/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "batch_normalization_120/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_120/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_120/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_120/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv2d_63/kernel", "shape": [1, 1, 256, 256], "dtype": "float32"}, {"name": "conv2d_63/bias", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_121/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_121/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_121/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_121/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "depth_wise_conv2d_59/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "batch_normalization_122/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_122/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_122/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_122/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv2d_64/kernel", "shape": [1, 1, 256, 512], "dtype": "float32"}, {"name": "conv2d_64/bias", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_123/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_123/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_123/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_123/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "depth_wise_conv2d_60/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "batch_normalization_124/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_124/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_124/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_124/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv2d_65/kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv2d_65/bias", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_125/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_125/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_125/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_125/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "depth_wise_conv2d_61/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "batch_normalization_126/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_126/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_126/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_126/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv2d_66/kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv2d_66/bias", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_127/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_127/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_127/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_127/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "depth_wise_conv2d_62/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "batch_normalization_128/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_128/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_128/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_128/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv2d_67/kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv2d_67/bias", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_129/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_129/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_129/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_129/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "depth_wise_conv2d_63/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "batch_normalization_130/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_130/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_130/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_130/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv2d_68/kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv2d_68/bias", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_131/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_131/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_131/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_131/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "depth_wise_conv2d_64/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "batch_normalization_132/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_132/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_132/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_132/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv2d_69/kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv2d_69/bias", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_133/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_133/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_133/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_133/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "depth_wise_conv2d_65/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "batch_normalization_134/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_134/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_134/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_134/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv2d_70/kernel", "shape": [1, 1, 512, 1024], "dtype": "float32"}, {"name": "conv2d_70/bias", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_135/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_135/beta", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_135/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_135/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "dense_5/kernel", "shape": [1024, 1000], "dtype": "float32"}, {"name": "dense_5/bias", "shape": [1000], "dtype": "float32"}]}]}