{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v1.7.2", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of6.bin", "group1-shard2of6.bin", "group1-shard3of6.bin", "group1-shard4of6.bin", "group1-shard5of6.bin", "group1-shard6of6.bin"], "weights": [{"name": "stem_conv1/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "stem_bn1/gamma", "shape": [32], "dtype": "float32"}, {"name": "stem_bn1/beta", "shape": [32], "dtype": "float32"}, {"name": "stem_bn1/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "stem_bn1/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/reduction_conv_1_stem_1/kernel", "shape": [1, 1, 32, 11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/reduction_bn_1_stem_1/gamma", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/reduction_bn_1_stem_1/beta", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/reduction_bn_1_stem_1/moving_mean", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/reduction_bn_1_stem_1/moving_variance", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_1/separable_conv_block_reduction_left1_stem_1/separable_conv_1_reduction_left1_stem_1/depthwise_kernel", "shape": [5, 5, 11, 1], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_1/separable_conv_block_reduction_left1_stem_1/separable_conv_1_reduction_left1_stem_1/pointwise_kernel", "shape": [1, 1, 11, 11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_1/separable_conv_block_reduction_1_stem_1/separable_conv_1_reduction_1_stem_1/depthwise_kernel", "shape": [7, 7, 32, 1], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_1/separable_conv_block_reduction_1_stem_1/separable_conv_1_reduction_1_stem_1/pointwise_kernel", "shape": [1, 1, 32, 11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_1/separable_conv_block_reduction_left1_stem_1/separable_conv_1_bn_reduction_left1_stem_1/gamma", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_1/separable_conv_block_reduction_left1_stem_1/separable_conv_1_bn_reduction_left1_stem_1/beta", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_1/separable_conv_block_reduction_left1_stem_1/separable_conv_1_bn_reduction_left1_stem_1/moving_mean", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_1/separable_conv_block_reduction_left1_stem_1/separable_conv_1_bn_reduction_left1_stem_1/moving_variance", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_1/separable_conv_block_reduction_1_stem_1/separable_conv_1_bn_reduction_1_stem_1/gamma", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_1/separable_conv_block_reduction_1_stem_1/separable_conv_1_bn_reduction_1_stem_1/beta", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_1/separable_conv_block_reduction_1_stem_1/separable_conv_1_bn_reduction_1_stem_1/moving_mean", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_1/separable_conv_block_reduction_1_stem_1/separable_conv_1_bn_reduction_1_stem_1/moving_variance", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_1/separable_conv_block_reduction_left1_stem_1/separable_conv_2_reduction_left1_stem_1/depthwise_kernel", "shape": [5, 5, 11, 1], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_1/separable_conv_block_reduction_left1_stem_1/separable_conv_2_reduction_left1_stem_1/pointwise_kernel", "shape": [1, 1, 11, 11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_1/separable_conv_block_reduction_1_stem_1/separable_conv_2_reduction_1_stem_1/depthwise_kernel", "shape": [7, 7, 11, 1], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_1/separable_conv_block_reduction_1_stem_1/separable_conv_2_reduction_1_stem_1/pointwise_kernel", "shape": [1, 1, 11, 11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_1/separable_conv_block_reduction_left1_stem_1/separable_conv_2_bn_reduction_left1_stem_1/gamma", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_1/separable_conv_block_reduction_left1_stem_1/separable_conv_2_bn_reduction_left1_stem_1/beta", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_1/separable_conv_block_reduction_left1_stem_1/separable_conv_2_bn_reduction_left1_stem_1/moving_mean", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_1/separable_conv_block_reduction_left1_stem_1/separable_conv_2_bn_reduction_left1_stem_1/moving_variance", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_1/separable_conv_block_reduction_1_stem_1/separable_conv_2_bn_reduction_1_stem_1/gamma", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_1/separable_conv_block_reduction_1_stem_1/separable_conv_2_bn_reduction_1_stem_1/beta", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_1/separable_conv_block_reduction_1_stem_1/separable_conv_2_bn_reduction_1_stem_1/moving_mean", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_1/separable_conv_block_reduction_1_stem_1/separable_conv_2_bn_reduction_1_stem_1/moving_variance", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_2/separable_conv_block_reduction_right2_stem_1/separable_conv_1_reduction_right2_stem_1/depthwise_kernel", "shape": [7, 7, 32, 1], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_2/separable_conv_block_reduction_right2_stem_1/separable_conv_1_reduction_right2_stem_1/pointwise_kernel", "shape": [1, 1, 32, 11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_2/separable_conv_block_reduction_right2_stem_1/separable_conv_1_bn_reduction_right2_stem_1/gamma", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_2/separable_conv_block_reduction_right2_stem_1/separable_conv_1_bn_reduction_right2_stem_1/beta", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_2/separable_conv_block_reduction_right2_stem_1/separable_conv_1_bn_reduction_right2_stem_1/moving_mean", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_2/separable_conv_block_reduction_right2_stem_1/separable_conv_1_bn_reduction_right2_stem_1/moving_variance", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_3/separable_conv_block_reduction_right3_stem_1/separable_conv_1_reduction_right3_stem_1/depthwise_kernel", "shape": [5, 5, 32, 1], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_3/separable_conv_block_reduction_right3_stem_1/separable_conv_1_reduction_right3_stem_1/pointwise_kernel", "shape": [1, 1, 32, 11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_5/separable_conv_block_reduction_left4_stem_1/separable_conv_1_reduction_left4_stem_1/depthwise_kernel", "shape": [3, 3, 11, 1], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_5/separable_conv_block_reduction_left4_stem_1/separable_conv_1_reduction_left4_stem_1/pointwise_kernel", "shape": [1, 1, 11, 11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_3/separable_conv_block_reduction_right3_stem_1/separable_conv_1_bn_reduction_right3_stem_1/gamma", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_3/separable_conv_block_reduction_right3_stem_1/separable_conv_1_bn_reduction_right3_stem_1/beta", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_3/separable_conv_block_reduction_right3_stem_1/separable_conv_1_bn_reduction_right3_stem_1/moving_mean", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_3/separable_conv_block_reduction_right3_stem_1/separable_conv_1_bn_reduction_right3_stem_1/moving_variance", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_5/separable_conv_block_reduction_left4_stem_1/separable_conv_1_bn_reduction_left4_stem_1/gamma", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_5/separable_conv_block_reduction_left4_stem_1/separable_conv_1_bn_reduction_left4_stem_1/beta", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_5/separable_conv_block_reduction_left4_stem_1/separable_conv_1_bn_reduction_left4_stem_1/moving_mean", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_5/separable_conv_block_reduction_left4_stem_1/separable_conv_1_bn_reduction_left4_stem_1/moving_variance", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_2/separable_conv_block_reduction_right2_stem_1/separable_conv_2_reduction_right2_stem_1/depthwise_kernel", "shape": [7, 7, 11, 1], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_2/separable_conv_block_reduction_right2_stem_1/separable_conv_2_reduction_right2_stem_1/pointwise_kernel", "shape": [1, 1, 11, 11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_2/separable_conv_block_reduction_right2_stem_1/separable_conv_2_bn_reduction_right2_stem_1/gamma", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_2/separable_conv_block_reduction_right2_stem_1/separable_conv_2_bn_reduction_right2_stem_1/beta", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_2/separable_conv_block_reduction_right2_stem_1/separable_conv_2_bn_reduction_right2_stem_1/moving_mean", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_2/separable_conv_block_reduction_right2_stem_1/separable_conv_2_bn_reduction_right2_stem_1/moving_variance", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_3/separable_conv_block_reduction_right3_stem_1/separable_conv_2_reduction_right3_stem_1/depthwise_kernel", "shape": [5, 5, 11, 1], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_3/separable_conv_block_reduction_right3_stem_1/separable_conv_2_reduction_right3_stem_1/pointwise_kernel", "shape": [1, 1, 11, 11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_5/separable_conv_block_reduction_left4_stem_1/separable_conv_2_reduction_left4_stem_1/depthwise_kernel", "shape": [3, 3, 11, 1], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_5/separable_conv_block_reduction_left4_stem_1/separable_conv_2_reduction_left4_stem_1/pointwise_kernel", "shape": [1, 1, 11, 11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_3/separable_conv_block_reduction_right3_stem_1/separable_conv_2_bn_reduction_right3_stem_1/gamma", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_3/separable_conv_block_reduction_right3_stem_1/separable_conv_2_bn_reduction_right3_stem_1/beta", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_3/separable_conv_block_reduction_right3_stem_1/separable_conv_2_bn_reduction_right3_stem_1/moving_mean", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_3/separable_conv_block_reduction_right3_stem_1/separable_conv_2_bn_reduction_right3_stem_1/moving_variance", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_5/separable_conv_block_reduction_left4_stem_1/separable_conv_2_bn_reduction_left4_stem_1/gamma", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_5/separable_conv_block_reduction_left4_stem_1/separable_conv_2_bn_reduction_left4_stem_1/beta", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_5/separable_conv_block_reduction_left4_stem_1/separable_conv_2_bn_reduction_left4_stem_1/moving_mean", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_1/block_5/separable_conv_block_reduction_left4_stem_1/separable_conv_2_bn_reduction_left4_stem_1/moving_variance", "shape": [11], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/adjust_block/adjust_reduction_block_stem_2/adjust_conv_1_stem_2/kernel", "shape": [1, 1, 32, 11], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/adjust_block/adjust_reduction_block_stem_2/adjust_conv_2_stem_2/kernel", "shape": [1, 1, 32, 11], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/reduction_conv_1_stem_2/kernel", "shape": [1, 1, 44, 22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/reduction_bn_1_stem_2/gamma", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/reduction_bn_1_stem_2/beta", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/reduction_bn_1_stem_2/moving_mean", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/reduction_bn_1_stem_2/moving_variance", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/adjust_block/adjust_reduction_block_stem_2/adjust_bn_stem_2/gamma", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/adjust_block/adjust_reduction_block_stem_2/adjust_bn_stem_2/beta", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/adjust_block/adjust_reduction_block_stem_2/adjust_bn_stem_2/moving_mean", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/adjust_block/adjust_reduction_block_stem_2/adjust_bn_stem_2/moving_variance", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_1/separable_conv_block_reduction_left1_stem_2/separable_conv_1_reduction_left1_stem_2/depthwise_kernel", "shape": [5, 5, 22, 1], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_1/separable_conv_block_reduction_left1_stem_2/separable_conv_1_reduction_left1_stem_2/pointwise_kernel", "shape": [1, 1, 22, 22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_1/separable_conv_block_reduction_1_stem_2/separable_conv_1_reduction_1_stem_2/depthwise_kernel", "shape": [7, 7, 22, 1], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_1/separable_conv_block_reduction_1_stem_2/separable_conv_1_reduction_1_stem_2/pointwise_kernel", "shape": [1, 1, 22, 22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_1/separable_conv_block_reduction_left1_stem_2/separable_conv_1_bn_reduction_left1_stem_2/gamma", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_1/separable_conv_block_reduction_left1_stem_2/separable_conv_1_bn_reduction_left1_stem_2/beta", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_1/separable_conv_block_reduction_left1_stem_2/separable_conv_1_bn_reduction_left1_stem_2/moving_mean", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_1/separable_conv_block_reduction_left1_stem_2/separable_conv_1_bn_reduction_left1_stem_2/moving_variance", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_1/separable_conv_block_reduction_1_stem_2/separable_conv_1_bn_reduction_1_stem_2/gamma", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_1/separable_conv_block_reduction_1_stem_2/separable_conv_1_bn_reduction_1_stem_2/beta", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_1/separable_conv_block_reduction_1_stem_2/separable_conv_1_bn_reduction_1_stem_2/moving_mean", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_1/separable_conv_block_reduction_1_stem_2/separable_conv_1_bn_reduction_1_stem_2/moving_variance", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_1/separable_conv_block_reduction_left1_stem_2/separable_conv_2_reduction_left1_stem_2/depthwise_kernel", "shape": [5, 5, 22, 1], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_1/separable_conv_block_reduction_left1_stem_2/separable_conv_2_reduction_left1_stem_2/pointwise_kernel", "shape": [1, 1, 22, 22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_1/separable_conv_block_reduction_1_stem_2/separable_conv_2_reduction_1_stem_2/depthwise_kernel", "shape": [7, 7, 22, 1], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_1/separable_conv_block_reduction_1_stem_2/separable_conv_2_reduction_1_stem_2/pointwise_kernel", "shape": [1, 1, 22, 22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_1/separable_conv_block_reduction_left1_stem_2/separable_conv_2_bn_reduction_left1_stem_2/gamma", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_1/separable_conv_block_reduction_left1_stem_2/separable_conv_2_bn_reduction_left1_stem_2/beta", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_1/separable_conv_block_reduction_left1_stem_2/separable_conv_2_bn_reduction_left1_stem_2/moving_mean", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_1/separable_conv_block_reduction_left1_stem_2/separable_conv_2_bn_reduction_left1_stem_2/moving_variance", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_1/separable_conv_block_reduction_1_stem_2/separable_conv_2_bn_reduction_1_stem_2/gamma", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_1/separable_conv_block_reduction_1_stem_2/separable_conv_2_bn_reduction_1_stem_2/beta", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_1/separable_conv_block_reduction_1_stem_2/separable_conv_2_bn_reduction_1_stem_2/moving_mean", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_1/separable_conv_block_reduction_1_stem_2/separable_conv_2_bn_reduction_1_stem_2/moving_variance", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_2/separable_conv_block_reduction_right2_stem_2/separable_conv_1_reduction_right2_stem_2/depthwise_kernel", "shape": [7, 7, 22, 1], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_2/separable_conv_block_reduction_right2_stem_2/separable_conv_1_reduction_right2_stem_2/pointwise_kernel", "shape": [1, 1, 22, 22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_2/separable_conv_block_reduction_right2_stem_2/separable_conv_1_bn_reduction_right2_stem_2/gamma", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_2/separable_conv_block_reduction_right2_stem_2/separable_conv_1_bn_reduction_right2_stem_2/beta", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_2/separable_conv_block_reduction_right2_stem_2/separable_conv_1_bn_reduction_right2_stem_2/moving_mean", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_2/separable_conv_block_reduction_right2_stem_2/separable_conv_1_bn_reduction_right2_stem_2/moving_variance", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_3/separable_conv_block_reduction_right3_stem_2/separable_conv_1_reduction_right3_stem_2/depthwise_kernel", "shape": [5, 5, 22, 1], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_3/separable_conv_block_reduction_right3_stem_2/separable_conv_1_reduction_right3_stem_2/pointwise_kernel", "shape": [1, 1, 22, 22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_5/separable_conv_block_reduction_left4_stem_2/separable_conv_1_reduction_left4_stem_2/depthwise_kernel", "shape": [3, 3, 22, 1], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_5/separable_conv_block_reduction_left4_stem_2/separable_conv_1_reduction_left4_stem_2/pointwise_kernel", "shape": [1, 1, 22, 22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_3/separable_conv_block_reduction_right3_stem_2/separable_conv_1_bn_reduction_right3_stem_2/gamma", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_3/separable_conv_block_reduction_right3_stem_2/separable_conv_1_bn_reduction_right3_stem_2/beta", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_3/separable_conv_block_reduction_right3_stem_2/separable_conv_1_bn_reduction_right3_stem_2/moving_mean", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_3/separable_conv_block_reduction_right3_stem_2/separable_conv_1_bn_reduction_right3_stem_2/moving_variance", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_5/separable_conv_block_reduction_left4_stem_2/separable_conv_1_bn_reduction_left4_stem_2/gamma", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_5/separable_conv_block_reduction_left4_stem_2/separable_conv_1_bn_reduction_left4_stem_2/beta", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_5/separable_conv_block_reduction_left4_stem_2/separable_conv_1_bn_reduction_left4_stem_2/moving_mean", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_5/separable_conv_block_reduction_left4_stem_2/separable_conv_1_bn_reduction_left4_stem_2/moving_variance", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_2/separable_conv_block_reduction_right2_stem_2/separable_conv_2_reduction_right2_stem_2/depthwise_kernel", "shape": [7, 7, 22, 1], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_2/separable_conv_block_reduction_right2_stem_2/separable_conv_2_reduction_right2_stem_2/pointwise_kernel", "shape": [1, 1, 22, 22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_2/separable_conv_block_reduction_right2_stem_2/separable_conv_2_bn_reduction_right2_stem_2/gamma", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_2/separable_conv_block_reduction_right2_stem_2/separable_conv_2_bn_reduction_right2_stem_2/beta", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_2/separable_conv_block_reduction_right2_stem_2/separable_conv_2_bn_reduction_right2_stem_2/moving_mean", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_2/separable_conv_block_reduction_right2_stem_2/separable_conv_2_bn_reduction_right2_stem_2/moving_variance", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_3/separable_conv_block_reduction_right3_stem_2/separable_conv_2_reduction_right3_stem_2/depthwise_kernel", "shape": [5, 5, 22, 1], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_3/separable_conv_block_reduction_right3_stem_2/separable_conv_2_reduction_right3_stem_2/pointwise_kernel", "shape": [1, 1, 22, 22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_5/separable_conv_block_reduction_left4_stem_2/separable_conv_2_reduction_left4_stem_2/depthwise_kernel", "shape": [3, 3, 22, 1], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_5/separable_conv_block_reduction_left4_stem_2/separable_conv_2_reduction_left4_stem_2/pointwise_kernel", "shape": [1, 1, 22, 22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_3/separable_conv_block_reduction_right3_stem_2/separable_conv_2_bn_reduction_right3_stem_2/gamma", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_3/separable_conv_block_reduction_right3_stem_2/separable_conv_2_bn_reduction_right3_stem_2/beta", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_3/separable_conv_block_reduction_right3_stem_2/separable_conv_2_bn_reduction_right3_stem_2/moving_mean", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_3/separable_conv_block_reduction_right3_stem_2/separable_conv_2_bn_reduction_right3_stem_2/moving_variance", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_5/separable_conv_block_reduction_left4_stem_2/separable_conv_2_bn_reduction_left4_stem_2/gamma", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_5/separable_conv_block_reduction_left4_stem_2/separable_conv_2_bn_reduction_left4_stem_2/beta", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_5/separable_conv_block_reduction_left4_stem_2/separable_conv_2_bn_reduction_left4_stem_2/moving_mean", "shape": [22], "dtype": "float32"}, {"name": "reduction_A_block_stem_2/block_5/separable_conv_block_reduction_left4_stem_2/separable_conv_2_bn_reduction_left4_stem_2/moving_variance", "shape": [22], "dtype": "float32"}, {"name": "normal_A_block_0/adjust_block/adjust_reduction_block_0/adjust_conv_1_0/kernel", "shape": [1, 1, 44, 22], "dtype": "float32"}, {"name": "normal_A_block_0/adjust_block/adjust_reduction_block_0/adjust_conv_2_0/kernel", "shape": [1, 1, 44, 22], "dtype": "float32"}, {"name": "normal_A_block_0/normal_conv_1_0/kernel", "shape": [1, 1, 88, 44], "dtype": "float32"}, {"name": "normal_A_block_0/adjust_block/adjust_reduction_block_0/adjust_bn_0/gamma", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/adjust_block/adjust_reduction_block_0/adjust_bn_0/beta", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/adjust_block/adjust_reduction_block_0/adjust_bn_0/moving_mean", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/adjust_block/adjust_reduction_block_0/adjust_bn_0/moving_variance", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/normal_bn_1_0/gamma", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/normal_bn_1_0/beta", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/normal_bn_1_0/moving_mean", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/normal_bn_1_0/moving_variance", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_1/separable_conv_block_normal_left1_0/separable_conv_1_normal_left1_0/depthwise_kernel", "shape": [5, 5, 44, 1], "dtype": "float32"}, {"name": "normal_A_block_0/block_1/separable_conv_block_normal_left1_0/separable_conv_1_normal_left1_0/pointwise_kernel", "shape": [1, 1, 44, 44], "dtype": "float32"}, {"name": "normal_A_block_0/block_1/separable_conv_block_normal_right1_0/separable_conv_1_normal_right1_0/depthwise_kernel", "shape": [3, 3, 44, 1], "dtype": "float32"}, {"name": "normal_A_block_0/block_1/separable_conv_block_normal_right1_0/separable_conv_1_normal_right1_0/pointwise_kernel", "shape": [1, 1, 44, 44], "dtype": "float32"}, {"name": "normal_A_block_0/block_2/separable_conv_block_normal_left2_0/separable_conv_1_normal_left2_0/depthwise_kernel", "shape": [5, 5, 44, 1], "dtype": "float32"}, {"name": "normal_A_block_0/block_2/separable_conv_block_normal_left2_0/separable_conv_1_normal_left2_0/pointwise_kernel", "shape": [1, 1, 44, 44], "dtype": "float32"}, {"name": "normal_A_block_0/block_2/separable_conv_block_normal_right2_0/separable_conv_1_normal_right2_0/depthwise_kernel", "shape": [3, 3, 44, 1], "dtype": "float32"}, {"name": "normal_A_block_0/block_2/separable_conv_block_normal_right2_0/separable_conv_1_normal_right2_0/pointwise_kernel", "shape": [1, 1, 44, 44], "dtype": "float32"}, {"name": "normal_A_block_0/block_5/separable_conv_block_normal_left5_0/separable_conv_1_normal_left5_0/depthwise_kernel", "shape": [3, 3, 44, 1], "dtype": "float32"}, {"name": "normal_A_block_0/block_5/separable_conv_block_normal_left5_0/separable_conv_1_normal_left5_0/pointwise_kernel", "shape": [1, 1, 44, 44], "dtype": "float32"}, {"name": "normal_A_block_0/block_1/separable_conv_block_normal_left1_0/separable_conv_1_bn_normal_left1_0/gamma", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_1/separable_conv_block_normal_left1_0/separable_conv_1_bn_normal_left1_0/beta", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_1/separable_conv_block_normal_left1_0/separable_conv_1_bn_normal_left1_0/moving_mean", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_1/separable_conv_block_normal_left1_0/separable_conv_1_bn_normal_left1_0/moving_variance", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_1/separable_conv_block_normal_right1_0/separable_conv_1_bn_normal_right1_0/gamma", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_1/separable_conv_block_normal_right1_0/separable_conv_1_bn_normal_right1_0/beta", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_1/separable_conv_block_normal_right1_0/separable_conv_1_bn_normal_right1_0/moving_mean", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_1/separable_conv_block_normal_right1_0/separable_conv_1_bn_normal_right1_0/moving_variance", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_2/separable_conv_block_normal_left2_0/separable_conv_1_bn_normal_left2_0/gamma", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_2/separable_conv_block_normal_left2_0/separable_conv_1_bn_normal_left2_0/beta", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_2/separable_conv_block_normal_left2_0/separable_conv_1_bn_normal_left2_0/moving_mean", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_2/separable_conv_block_normal_left2_0/separable_conv_1_bn_normal_left2_0/moving_variance", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_2/separable_conv_block_normal_right2_0/separable_conv_1_bn_normal_right2_0/gamma", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_2/separable_conv_block_normal_right2_0/separable_conv_1_bn_normal_right2_0/beta", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_2/separable_conv_block_normal_right2_0/separable_conv_1_bn_normal_right2_0/moving_mean", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_2/separable_conv_block_normal_right2_0/separable_conv_1_bn_normal_right2_0/moving_variance", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_5/separable_conv_block_normal_left5_0/separable_conv_1_bn_normal_left5_0/gamma", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_5/separable_conv_block_normal_left5_0/separable_conv_1_bn_normal_left5_0/beta", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_5/separable_conv_block_normal_left5_0/separable_conv_1_bn_normal_left5_0/moving_mean", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_5/separable_conv_block_normal_left5_0/separable_conv_1_bn_normal_left5_0/moving_variance", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_1/separable_conv_block_normal_left1_0/separable_conv_2_normal_left1_0/depthwise_kernel", "shape": [5, 5, 44, 1], "dtype": "float32"}, {"name": "normal_A_block_0/block_1/separable_conv_block_normal_left1_0/separable_conv_2_normal_left1_0/pointwise_kernel", "shape": [1, 1, 44, 44], "dtype": "float32"}, {"name": "normal_A_block_0/block_1/separable_conv_block_normal_right1_0/separable_conv_2_normal_right1_0/depthwise_kernel", "shape": [3, 3, 44, 1], "dtype": "float32"}, {"name": "normal_A_block_0/block_1/separable_conv_block_normal_right1_0/separable_conv_2_normal_right1_0/pointwise_kernel", "shape": [1, 1, 44, 44], "dtype": "float32"}, {"name": "normal_A_block_0/block_2/separable_conv_block_normal_left2_0/separable_conv_2_normal_left2_0/depthwise_kernel", "shape": [5, 5, 44, 1], "dtype": "float32"}, {"name": "normal_A_block_0/block_2/separable_conv_block_normal_left2_0/separable_conv_2_normal_left2_0/pointwise_kernel", "shape": [1, 1, 44, 44], "dtype": "float32"}, {"name": "normal_A_block_0/block_2/separable_conv_block_normal_right2_0/separable_conv_2_normal_right2_0/depthwise_kernel", "shape": [3, 3, 44, 1], "dtype": "float32"}, {"name": "normal_A_block_0/block_2/separable_conv_block_normal_right2_0/separable_conv_2_normal_right2_0/pointwise_kernel", "shape": [1, 1, 44, 44], "dtype": "float32"}, {"name": "normal_A_block_0/block_5/separable_conv_block_normal_left5_0/separable_conv_2_normal_left5_0/depthwise_kernel", "shape": [3, 3, 44, 1], "dtype": "float32"}, {"name": "normal_A_block_0/block_5/separable_conv_block_normal_left5_0/separable_conv_2_normal_left5_0/pointwise_kernel", "shape": [1, 1, 44, 44], "dtype": "float32"}, {"name": "normal_A_block_0/block_1/separable_conv_block_normal_left1_0/separable_conv_2_bn_normal_left1_0/gamma", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_1/separable_conv_block_normal_left1_0/separable_conv_2_bn_normal_left1_0/beta", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_1/separable_conv_block_normal_left1_0/separable_conv_2_bn_normal_left1_0/moving_mean", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_1/separable_conv_block_normal_left1_0/separable_conv_2_bn_normal_left1_0/moving_variance", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_1/separable_conv_block_normal_right1_0/separable_conv_2_bn_normal_right1_0/gamma", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_1/separable_conv_block_normal_right1_0/separable_conv_2_bn_normal_right1_0/beta", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_1/separable_conv_block_normal_right1_0/separable_conv_2_bn_normal_right1_0/moving_mean", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_1/separable_conv_block_normal_right1_0/separable_conv_2_bn_normal_right1_0/moving_variance", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_2/separable_conv_block_normal_left2_0/separable_conv_2_bn_normal_left2_0/gamma", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_2/separable_conv_block_normal_left2_0/separable_conv_2_bn_normal_left2_0/beta", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_2/separable_conv_block_normal_left2_0/separable_conv_2_bn_normal_left2_0/moving_mean", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_2/separable_conv_block_normal_left2_0/separable_conv_2_bn_normal_left2_0/moving_variance", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_2/separable_conv_block_normal_right2_0/separable_conv_2_bn_normal_right2_0/gamma", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_2/separable_conv_block_normal_right2_0/separable_conv_2_bn_normal_right2_0/beta", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_2/separable_conv_block_normal_right2_0/separable_conv_2_bn_normal_right2_0/moving_mean", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_2/separable_conv_block_normal_right2_0/separable_conv_2_bn_normal_right2_0/moving_variance", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_5/separable_conv_block_normal_left5_0/separable_conv_2_bn_normal_left5_0/gamma", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_5/separable_conv_block_normal_left5_0/separable_conv_2_bn_normal_left5_0/beta", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_5/separable_conv_block_normal_left5_0/separable_conv_2_bn_normal_left5_0/moving_mean", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_0/block_5/separable_conv_block_normal_left5_0/separable_conv_2_bn_normal_left5_0/moving_variance", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/adjust_block/adjust_projection_block_1/adjust_conv_projection_1/kernel", "shape": [1, 1, 88, 44], "dtype": "float32"}, {"name": "normal_A_block_1/normal_conv_1_1/kernel", "shape": [1, 1, 264, 44], "dtype": "float32"}, {"name": "normal_A_block_1/adjust_block/adjust_projection_block_1/adjust_bn_1/gamma", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/adjust_block/adjust_projection_block_1/adjust_bn_1/beta", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/adjust_block/adjust_projection_block_1/adjust_bn_1/moving_mean", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/adjust_block/adjust_projection_block_1/adjust_bn_1/moving_variance", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/normal_bn_1_1/gamma", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/normal_bn_1_1/beta", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/normal_bn_1_1/moving_mean", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/normal_bn_1_1/moving_variance", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_1/separable_conv_block_normal_left1_1/separable_conv_1_normal_left1_1/depthwise_kernel", "shape": [5, 5, 44, 1], "dtype": "float32"}, {"name": "normal_A_block_1/block_1/separable_conv_block_normal_left1_1/separable_conv_1_normal_left1_1/pointwise_kernel", "shape": [1, 1, 44, 44], "dtype": "float32"}, {"name": "normal_A_block_1/block_1/separable_conv_block_normal_right1_1/separable_conv_1_normal_right1_1/depthwise_kernel", "shape": [3, 3, 44, 1], "dtype": "float32"}, {"name": "normal_A_block_1/block_1/separable_conv_block_normal_right1_1/separable_conv_1_normal_right1_1/pointwise_kernel", "shape": [1, 1, 44, 44], "dtype": "float32"}, {"name": "normal_A_block_1/block_2/separable_conv_block_normal_left2_1/separable_conv_1_normal_left2_1/depthwise_kernel", "shape": [5, 5, 44, 1], "dtype": "float32"}, {"name": "normal_A_block_1/block_2/separable_conv_block_normal_left2_1/separable_conv_1_normal_left2_1/pointwise_kernel", "shape": [1, 1, 44, 44], "dtype": "float32"}, {"name": "normal_A_block_1/block_2/separable_conv_block_normal_right2_1/separable_conv_1_normal_right2_1/depthwise_kernel", "shape": [3, 3, 44, 1], "dtype": "float32"}, {"name": "normal_A_block_1/block_2/separable_conv_block_normal_right2_1/separable_conv_1_normal_right2_1/pointwise_kernel", "shape": [1, 1, 44, 44], "dtype": "float32"}, {"name": "normal_A_block_1/block_5/separable_conv_block_normal_left5_1/separable_conv_1_normal_left5_1/depthwise_kernel", "shape": [3, 3, 44, 1], "dtype": "float32"}, {"name": "normal_A_block_1/block_5/separable_conv_block_normal_left5_1/separable_conv_1_normal_left5_1/pointwise_kernel", "shape": [1, 1, 44, 44], "dtype": "float32"}, {"name": "normal_A_block_1/block_1/separable_conv_block_normal_left1_1/separable_conv_1_bn_normal_left1_1/gamma", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_1/separable_conv_block_normal_left1_1/separable_conv_1_bn_normal_left1_1/beta", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_1/separable_conv_block_normal_left1_1/separable_conv_1_bn_normal_left1_1/moving_mean", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_1/separable_conv_block_normal_left1_1/separable_conv_1_bn_normal_left1_1/moving_variance", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_1/separable_conv_block_normal_right1_1/separable_conv_1_bn_normal_right1_1/gamma", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_1/separable_conv_block_normal_right1_1/separable_conv_1_bn_normal_right1_1/beta", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_1/separable_conv_block_normal_right1_1/separable_conv_1_bn_normal_right1_1/moving_mean", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_1/separable_conv_block_normal_right1_1/separable_conv_1_bn_normal_right1_1/moving_variance", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_2/separable_conv_block_normal_left2_1/separable_conv_1_bn_normal_left2_1/gamma", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_2/separable_conv_block_normal_left2_1/separable_conv_1_bn_normal_left2_1/beta", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_2/separable_conv_block_normal_left2_1/separable_conv_1_bn_normal_left2_1/moving_mean", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_2/separable_conv_block_normal_left2_1/separable_conv_1_bn_normal_left2_1/moving_variance", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_2/separable_conv_block_normal_right2_1/separable_conv_1_bn_normal_right2_1/gamma", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_2/separable_conv_block_normal_right2_1/separable_conv_1_bn_normal_right2_1/beta", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_2/separable_conv_block_normal_right2_1/separable_conv_1_bn_normal_right2_1/moving_mean", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_2/separable_conv_block_normal_right2_1/separable_conv_1_bn_normal_right2_1/moving_variance", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_5/separable_conv_block_normal_left5_1/separable_conv_1_bn_normal_left5_1/gamma", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_5/separable_conv_block_normal_left5_1/separable_conv_1_bn_normal_left5_1/beta", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_5/separable_conv_block_normal_left5_1/separable_conv_1_bn_normal_left5_1/moving_mean", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_5/separable_conv_block_normal_left5_1/separable_conv_1_bn_normal_left5_1/moving_variance", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_1/separable_conv_block_normal_left1_1/separable_conv_2_normal_left1_1/depthwise_kernel", "shape": [5, 5, 44, 1], "dtype": "float32"}, {"name": "normal_A_block_1/block_1/separable_conv_block_normal_left1_1/separable_conv_2_normal_left1_1/pointwise_kernel", "shape": [1, 1, 44, 44], "dtype": "float32"}, {"name": "normal_A_block_1/block_1/separable_conv_block_normal_right1_1/separable_conv_2_normal_right1_1/depthwise_kernel", "shape": [3, 3, 44, 1], "dtype": "float32"}, {"name": "normal_A_block_1/block_1/separable_conv_block_normal_right1_1/separable_conv_2_normal_right1_1/pointwise_kernel", "shape": [1, 1, 44, 44], "dtype": "float32"}, {"name": "normal_A_block_1/block_2/separable_conv_block_normal_left2_1/separable_conv_2_normal_left2_1/depthwise_kernel", "shape": [5, 5, 44, 1], "dtype": "float32"}, {"name": "normal_A_block_1/block_2/separable_conv_block_normal_left2_1/separable_conv_2_normal_left2_1/pointwise_kernel", "shape": [1, 1, 44, 44], "dtype": "float32"}, {"name": "normal_A_block_1/block_2/separable_conv_block_normal_right2_1/separable_conv_2_normal_right2_1/depthwise_kernel", "shape": [3, 3, 44, 1], "dtype": "float32"}, {"name": "normal_A_block_1/block_2/separable_conv_block_normal_right2_1/separable_conv_2_normal_right2_1/pointwise_kernel", "shape": [1, 1, 44, 44], "dtype": "float32"}, {"name": "normal_A_block_1/block_5/separable_conv_block_normal_left5_1/separable_conv_2_normal_left5_1/depthwise_kernel", "shape": [3, 3, 44, 1], "dtype": "float32"}, {"name": "normal_A_block_1/block_5/separable_conv_block_normal_left5_1/separable_conv_2_normal_left5_1/pointwise_kernel", "shape": [1, 1, 44, 44], "dtype": "float32"}, {"name": "normal_A_block_1/block_1/separable_conv_block_normal_left1_1/separable_conv_2_bn_normal_left1_1/gamma", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_1/separable_conv_block_normal_left1_1/separable_conv_2_bn_normal_left1_1/beta", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_1/separable_conv_block_normal_left1_1/separable_conv_2_bn_normal_left1_1/moving_mean", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_1/separable_conv_block_normal_left1_1/separable_conv_2_bn_normal_left1_1/moving_variance", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_1/separable_conv_block_normal_right1_1/separable_conv_2_bn_normal_right1_1/gamma", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_1/separable_conv_block_normal_right1_1/separable_conv_2_bn_normal_right1_1/beta", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_1/separable_conv_block_normal_right1_1/separable_conv_2_bn_normal_right1_1/moving_mean", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_1/separable_conv_block_normal_right1_1/separable_conv_2_bn_normal_right1_1/moving_variance", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_2/separable_conv_block_normal_left2_1/separable_conv_2_bn_normal_left2_1/gamma", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_2/separable_conv_block_normal_left2_1/separable_conv_2_bn_normal_left2_1/beta", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_2/separable_conv_block_normal_left2_1/separable_conv_2_bn_normal_left2_1/moving_mean", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_2/separable_conv_block_normal_left2_1/separable_conv_2_bn_normal_left2_1/moving_variance", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_2/separable_conv_block_normal_right2_1/separable_conv_2_bn_normal_right2_1/gamma", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_2/separable_conv_block_normal_right2_1/separable_conv_2_bn_normal_right2_1/beta", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_2/separable_conv_block_normal_right2_1/separable_conv_2_bn_normal_right2_1/moving_mean", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_2/separable_conv_block_normal_right2_1/separable_conv_2_bn_normal_right2_1/moving_variance", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_5/separable_conv_block_normal_left5_1/separable_conv_2_bn_normal_left5_1/gamma", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_5/separable_conv_block_normal_left5_1/separable_conv_2_bn_normal_left5_1/beta", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_5/separable_conv_block_normal_left5_1/separable_conv_2_bn_normal_left5_1/moving_mean", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_1/block_5/separable_conv_block_normal_left5_1/separable_conv_2_bn_normal_left5_1/moving_variance", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_2/adjust_block/adjust_projection_block_2/adjust_conv_projection_2/kernel", "shape": [1, 1, 264, 44], "dtype": "float32"}, {"name": "normal_A_block_2/normal_conv_1_2/kernel", "shape": [1, 1, 264, 44], "dtype": "float32"}, {"name": "normal_A_block_2/adjust_block/adjust_projection_block_2/adjust_bn_2/gamma", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_2/adjust_block/adjust_projection_block_2/adjust_bn_2/beta", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_2/adjust_block/adjust_projection_block_2/adjust_bn_2/moving_mean", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_2/adjust_block/adjust_projection_block_2/adjust_bn_2/moving_variance", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_2/normal_bn_1_2/gamma", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_2/normal_bn_1_2/beta", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_2/normal_bn_1_2/moving_mean", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_2/normal_bn_1_2/moving_variance", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_2/block_1/separable_conv_block_normal_left1_2/separable_conv_1_normal_left1_2/depthwise_kernel", "shape": [5, 5, 44, 1], "dtype": "float32"}, {"name": "normal_A_block_2/block_1/separable_conv_block_normal_left1_2/separable_conv_1_normal_left1_2/pointwise_kernel", "shape": [1, 1, 44, 44], "dtype": "float32"}, {"name": "normal_A_block_2/block_1/separable_conv_block_normal_right1_2/separable_conv_1_normal_right1_2/depthwise_kernel", "shape": [3, 3, 44, 1], "dtype": "float32"}, {"name": "normal_A_block_2/block_1/separable_conv_block_normal_right1_2/separable_conv_1_normal_right1_2/pointwise_kernel", "shape": [1, 1, 44, 44], "dtype": "float32"}, {"name": "normal_A_block_2/block_2/separable_conv_block_normal_left2_2/separable_conv_1_normal_left2_2/depthwise_kernel", "shape": [5, 5, 44, 1], "dtype": "float32"}, {"name": "normal_A_block_2/block_2/separable_conv_block_normal_left2_2/separable_conv_1_normal_left2_2/pointwise_kernel", "shape": [1, 1, 44, 44], "dtype": "float32"}, {"name": "normal_A_block_2/block_2/separable_conv_block_normal_right2_2/separable_conv_1_normal_right2_2/depthwise_kernel", "shape": [3, 3, 44, 1], "dtype": "float32"}, {"name": "normal_A_block_2/block_2/separable_conv_block_normal_right2_2/separable_conv_1_normal_right2_2/pointwise_kernel", "shape": [1, 1, 44, 44], "dtype": "float32"}, {"name": "normal_A_block_2/block_5/separable_conv_block_normal_left5_2/separable_conv_1_normal_left5_2/depthwise_kernel", "shape": [3, 3, 44, 1], "dtype": "float32"}, {"name": "normal_A_block_2/block_5/separable_conv_block_normal_left5_2/separable_conv_1_normal_left5_2/pointwise_kernel", "shape": [1, 1, 44, 44], "dtype": "float32"}, {"name": "normal_A_block_2/block_1/separable_conv_block_normal_left1_2/separable_conv_1_bn_normal_left1_2/gamma", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_2/block_1/separable_conv_block_normal_left1_2/separable_conv_1_bn_normal_left1_2/beta", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_2/block_1/separable_conv_block_normal_left1_2/separable_conv_1_bn_normal_left1_2/moving_mean", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_2/block_1/separable_conv_block_normal_left1_2/separable_conv_1_bn_normal_left1_2/moving_variance", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_2/block_1/separable_conv_block_normal_right1_2/separable_conv_1_bn_normal_right1_2/gamma", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_2/block_1/separable_conv_block_normal_right1_2/separable_conv_1_bn_normal_right1_2/beta", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_2/block_1/separable_conv_block_normal_right1_2/separable_conv_1_bn_normal_right1_2/moving_mean", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_2/block_1/separable_conv_block_normal_right1_2/separable_conv_1_bn_normal_right1_2/moving_variance", "shape": [44], "dtype": "float32"}, {"name": "normal_A_block_2/block_2/separable_conv_block_normal_left2_2/separable_conv_1_bn_normal_left2_2/gamma", "shape": [44], "dtype": "float32"}, {"name": 